[
  {
    "paperId": 76,
    "paperTitle": "Unveiling Text in Challenging Stone Inscriptions: A Spatially-Adaptive Patching Strategy for Binarization",
    "authors": "Pratyush Jena (IIIT Hyderabad); Amal Joseph (IIIT Hyderabad); Arnav Sharma (IIIT Hyderabad); Ravi Kiran Sarvadevabhatla (IIIT Hyderabad)*",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 303,
    "paperTitle": "Improving Video Question Answering through query-based frame selection",
    "authors": "Himanshu Patil (Indian Institute of Technology Bombay)*; Geo Jolly (Indian Institute of Technology Bombay); Ramana Raja Buddala (Indian Institute of Technology Bombay); Ganesh Ramakrishnan (Indian Institute of Technology Bombay)",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 130,
    "paperTitle": "From Words to Paragraphs: Hierarchical Dense Text Detection with SAM-Adaptive Backbone",
    "authors": "Shashank Vempati (IIT Delhi)*; Gaurav Talebailkar (IIT Delhi); Sai Prabhath Bogam (IIT Delhi); Bhaskar Arun (Tata 1mg); Kayalvizhi Ganesan (Tata 1mg); Chetan Arora (IIT Delhi)",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 90,
    "paperTitle": "HalluShift++: Bridging Language and Vision through Internal Representation Shifts for Hierarchical Hallucinations in MLLMs",
    "authors": "Sukanya Das (Indian Institute of Technology Kharagpur)*; Debasis Samanta (Indian Institute of Technology Kharagpur); Monalisa Sarma (Indian Institute of Technology Kharagpur); Sujoy Nath (Netaji Subhash Engineering College); Arkaprabha Basu (TCG Crest) *; Sharanya Dasgupta (Indian Statistical Institute, Kolkata); Swagatam Das (Indian Statistical Institute, Kolkata)",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 344,
    "paperTitle": "Statistically Validated Hybrid Fusion and Ensemble Feature Selection for Static Sign Language Recognition",
    "authors": "Sukanya Das (Indian Institute of Technology Kharagpur)*; Debasis Samanta (Indian Institute of Technology Kharagpur); Monalisa Sarma (Indian Institute of Technology Kharagpur)",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 262,
    "paperTitle": "Low SNR Speech Perception with HuBERT: A Discussion on Visual-Audio Fusion and Domain-Specific Modeling",
    "authors": "Jayasree Saha (IIIT-Hyderabad)*; vinay Namboodiri (University of Bath); C. V Jawahar (IIIT hyderabad)",
    "broadArea": "Vison-Language Models",
    "session": "Oral Session-1",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 286,
    "paperTitle": "GeMR: Multi-modal Interactive 3D Scene Composition In XR",
    "authors": "Raghav Mittal (TCS Research ); Lokender Tiwari (TCS Research)*; Shivam Ashok Shukla (TCS Research); Mritunjoy Halder (TCS Research); Brojeshwar Bhowmick (TCS Research)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 177,
    "paperTitle": "PHAF: Personalised Hand Avatar in a Flash",
    "authors": "Meghana Shankar (Samsung)*; Akanxit Upadhyay (Samsung); Anmol Namdev (Samsung); Green Rosh KS (Samsung); Pawan Prasad BH (Samsung)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 209,
    "paperTitle": "Mesh Object Retrieval using Self-Supervised Mesh Convolution",
    "authors": "Kajal Sanklecha (International Institute of Information Technology, Hyderabad)*; Siddharth Mangipudi (International Institute of Information Technology, Hyderabad); Prayushi Mathur (International Institute of Information Technology, Hyderabad); P. J. Narayanan (International Institute of Information Technology, Hyderabad)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 64,
    "paperTitle": "Screen2UI: Pixel-Only On-Device UI Hierarchy Generation",
    "authors": "Anup Kushwaha (Samsung)*; Banseedhar Gondaliya (Samsung R&D Institute Bangalore); Chandramouli Sanchi (Samsung R&D Institute Bangalore); Surya Kumar (Samsung R&D Institute Bangalore); Apil Thapa (Samsung R&D Institute Bangalore); Edula Sri Ranga Srihit Reddy (Samsung R&D Institute Bangalore)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 337,
    "paperTitle": "Retrieval Augmented Continuous Person Tracking and Re-Identification",
    "authors": "Madan Sharma (Rajiv Gandhi Institute of Petroleum Technology); Aditya Singh (Rajiv Gandhi Institute of Petroleum Technology); Ashank Kunwar (Rajiv Gandhi Institute of Petroleum Technology); Nirbhay Kumar Tagore (Rajiv Gandhi Institute of Petroleum Technology)*; Sachin Kumar (Rajiv Gandhi Institute of Petroleum Technology)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 140,
    "paperTitle": "CSGaze: Context-aware Social Gaze Prediction",
    "authors": "Surbhi Madan (IIT Ropar); Shreya Ghosh (Curtin University)*; Ramanathan Subramanian (University of Canberra); Shreya Gedeon (Curtin University); Abhinav Dhall (Monash University)",
    "broadArea": "Motion and 3D, Graphics",
    "session": "Oral Session-2",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 341,
    "paperTitle": "DWT-Mamba: A Spatially-Aware State Space Model for Medical Image Classification",
    "authors": "Moumita Dholey (Indian Institute of Technology Kharagpur)*; Rosina Ahmed (Tata Medical Center Kolkata); Sanjoy Chatterjee (Tata Medical Center Kolkata); Jayanta Mukhopadhyay (Indian Institute of Technology Kharagpur)",
    "broadArea": "Medical Vision",
    "session": "Oral Session-3",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 192,
    "paperTitle": "Is the Spatial Structure as Important as Temporal Structure in EEG Signals?",
    "authors": "Aryan Naveen (National Institute of Technology Karnataka, Surathkal)*; Gopika Gopan K (Wadhwani AI); Neelam Sinha (Centre for Brain Research, Indian Institute of Science, Bengaluru)",
    "broadArea": "Medical Vision",
    "session": "Oral Session-3",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 226,
    "paperTitle": "Leveraging Task-Specific Knowledge from LLM for Semi-Supervised 3D Medical Image Segmentation",
    "authors": "Suruchi Kumari (Indian institute of technology Roorkee)*; Aryan Das (School Of Computer Science Engineering, Vellore Institute of Technology, Bhopal); Swalpa Kumar Roy (Alipurduar Government Engineering and Management College); Indu Joshi (Indian Institute of Technology Mandi); Pravendra Singh (Indian institute of technology Roorkee)",
    "broadArea": "Medical Vision",
    "session": "Oral Session-3",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 176,
    "paperTitle": "Severity Grading of Autism Spectrum Disorder from Eye Gaze Scanpath Trajectory using Deep Learning",
    "authors": "Debmani Saha (Indian Institute of Information Technology Kalyani)*; Dr. Kumari Rina (All India Institute of Medical Sciences Kalyani); Dr. Deepshikha Ray (University of Calcutta); Dr. Kaushik Mukhopadhyay (All India Institute of Medical Sciences Kalyani); Ayoleena Roy (All India Institute of Medical Sciences Kalyani ); Dr. Oishila Bandyopadhyay (Indian Institute of Information Technology Kalyani)",
    "broadArea": "Medical Vision",
    "session": "Oral Session-3",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 259,
    "paperTitle": "How Does India Cook Biryani?",
    "authors": "Farzana S (IIIT Hyderabad); CV Rishi (IIIT Hyderabad); Shubham Goel (IIIT Hyderabad)*; Aditya Arun (IIIT Hyderabad); CV Jawahar (IIIT Hyderbad)",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 54,
    "paperTitle": "Lightweight and Accurate Deepfake Detection using Gradient-Aware SE-Enhanced EfficientNetV2-S",
    "authors": "Prof. Ketan P. Detroja IIT Hyderabad Contrl (\"Respected member, IPC, ICIEV\")*",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 117,
    "paperTitle": "Railway Infrastructure Segmentation Using Pyramid Attention Network (PAN)",
    "authors": "Lakshmi Revathi Krosuri (Velagapudi Ramakrishna Siddhartha Engineering College); Sai Sri Harsha Chintalapudi (Velagapudi Ramakrishna Siddhartha Engineering College)*; Sree Krishna Anirudh Suri (Velagapudi Ramakrishna Siddhartha Engineering College); Pennavi Namburu (Velagapudi Ramakrishna Siddhartha Engineering College)",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 153,
    "paperTitle": "FedLeaf:Decentralizing Leaf Disease Detection with Self-Supervised Federated Learning and Consensus",
    "authors": "Sagnik Ghosh (INDIAN INSTITUTE OF TECHNOLOGY KHARAGPUR)",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 182,
    "paperTitle": "Are We There Yet? Exploring the Capabilities of MLLMs in Assistive AI Applications",
    "authors": "Shayon Dasgupta (IIT (BHU) Varanasi); Avijit Dasgupta (IIIT Hyderabad)*; Jawahar C. V. (IIIT Hyderabad)",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 232,
    "paperTitle": "Behavioral Evaluation of Prospect-Theoretic Instance-Based Learning: Modeling Risk and Alternation in Experience-Based Decisions",
    "authors": "Devansh Shrestha (IIT mandi); Varun Dutt (IIT Mandi)*",
    "broadArea": "Applications of CV/IP/Graphics",
    "session": "Oral Session-4",
    "additionalPosterSession": "Poster-Session-2",
    "sessionChair": ""
  },
  {
    "paperId": 41,
    "paperTitle": "Compressive Modeling and Visualization of Multivariate Scientific Data using Implicit Neural Representation",
    "authors": "ABHAY DWIVEDI (IIT Kanpur); Shanu Saklani (IIT Kanpur); Soumya Dutta (IIT Kanpur)*",
    "broadArea": "Core Deep Learning/Machine Learning",
    "session": "Oral Session-5",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 29,
    "paperTitle": "Smoothness-Preserving Deep Semi Non-negative Matrix Factorization for Clustering",
    "authors": "Debapriya Roy (Kundu) (ISI Kolkata)*; Angshul Majumdar (TCG CREST)",
    "broadArea": "Core Deep Learning/Machine Learning",
    "session": "Oral Session-5",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 136,
    "paperTitle": "Hyperbolic Fuzzy C-Means with Adaptive Weight-based Filtering for Efficient Clustering",
    "authors": "Arghya Pratihar (Indian Statistical Institute)*; Swagato Das (Indian Statistical Institute); Swagatam Das (Indian Statistical Institute)",
    "broadArea": "Core Deep Learning/Machine Learning",
    "session": "Oral Session-5",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 173,
    "paperTitle": "Contextual Memory Recall: A Novel Metric for Class Incremental Learning",
    "authors": "Balasubramanian S (Sri Sathya Sai Institute of Higher Learning); Sai Subramaniam M (Sri Sathya Sai Institute of Higher Learning); Sai Sriram Talasu (Sri Sathya Sai Institute of Higher Learning); Yedu Krishna P (Sri Sathya Sai Institute of Higher Learning); Pranav Phanindra Sai Manepalli (Sri Sathya Sai Institute of Higher Learning); Darshan Gera (Sri Sathya Sai Institute of Higher Learning); Ravi Mukkamala (Old Dominion University)*",
    "broadArea": "Core Deep Learning/Machine Learning",
    "session": "Oral Session-5",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 230,
    "paperTitle": "A Fast Lossless Compression Algorithm for Color Filter Arrays",
    "authors": "Chiranjeev Bhaya (Samsung R&D, Bangalore; IIT ISM Dhanbad)*; Mithil Shail (Samsung R&D, Bangalore); Chandra Mohan Velpula (Samsung R&D, Bangalore); Sarbojit Ganguly (Samsung R&D, Bangalore); Praveen Bangre Prabhakar Rao (Samsung R&D, Bangalore)",
    "broadArea": "Low-Level Vision",
    "session": "Oral Session-6",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 119,
    "paperTitle": "Sharing the Learned Knowledge-base to Estimate Convolutional Filter Parameters for Continual Image Restoration",
    "authors": "Aupendu Kar (Dolby Laboratories, Inc.)*; Krishnendu Ghosh (IIT Kharagpur); Prabir Kumar Biswas (IIT Kharagpur)",
    "broadArea": "Low-Level Vision",
    "session": "Oral Session-6",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 34,
    "paperTitle": "Mimicking Human Visual Development for Learning Robust Image Representations",
    "authors": "Ankita Raj (Indian Institute of Technology Delhi)*; Kaashika Prajaapat (Clinikally); Tapan Gandhi (Indian Institute of Technology Delhi); Chetan Arora (Indian Institute of Technology Delhi)",
    "broadArea": "Low-Level Vision",
    "session": "Oral Session-6",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  },
  {
    "paperId": 147,
    "paperTitle": "A Hybrid Dataset and Depth-Guided Transformer for Nighttime Flare Removal",
    "authors": "Advait Kisar (Indian Institute of Technology Madras)*; Sumeet Shekhar (Indian Institute of Technology Madras); Gopi Raju Matta (Indian Institute of Technology Madras); Kaushik Mitra (Indian Institute of Technology Madras)",
    "broadArea": "Low-Level Vision",
    "session": "Oral Session-6",
    "additionalPosterSession": "Poster-Session-1",
    "sessionChair": ""
  }
]
